"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц
(зима, весна, лето, осень). Напишите решения через list и через dict.
"""
while True:
    num_month = input("Введите номер месяца: ")
    if num_month.isdigit():
        if 1 <= int(num_month) <= 12:
            break
        else:
            print("Такого месяца не существует")
    else:
        print("Нужно ввести положительное число")

list_month = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]
dict_month = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень",
              10: "осень", 11: "осень", 12: "зима"}

print(f"Реализация через список - {list_month[int(num_month) - 1]}")
print(f"Реализация через словарь - {dict_month.get(int(num_month))}")
